posts/call-me-ishmael/index.org
#+BEGIN_COMMENT
.. title: Call me Ishmael
.. slug: call-me-ishmael
.. date: 2018-04-07 22:17:15 UTC+01:00
.. tags: rant, blog
.. category: blog
.. link:
.. description:
.. type: text
#+END_COMMENT


* Where am I?

This is my *brand* new blog, problems with my past hosting service, a nauseating CMS (wordpress) and a desire to write my rants in the beautiful org-mode led me to creating this site.

* What's it for?

What's any blog for really?

Mostly I wanted a method of informally discussing my current projects and interests and possibly write a tutorial or two as well.
