index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="description" content="A blog ranting about my research, personal projects and all that I find interesting">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Nathan Hughes' blog</title>
<link href="assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="rss.xml">
<link rel="canonical" href="https://sirsharpest.github.io/">
<!--[if lt IE 9]><![endif]--><link rel="prefetch" href="posts/call-me-ishmael/" type="text/html">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="https://sirsharpest.github.io/">

                <span id="blog-title">Nathan Hughes' blog</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="archive.html">Archive</a>
                </li>
<li>
<a href="categories/">Tags</a>
                </li>
<li>
<a href="rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right"></ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            

    


    
<div class="postindex">
    <article class="h-entry post-text"><header><h1 class="p-name entry-title"><a href="posts/call-me-ishmael/" class="u-url">Call me Ishmael</a></h1>
        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                Nathan Hughes
            </span></p>
            <p class="dateline"><a href="posts/call-me-ishmael/" rel="bookmark"><time class="published dt-published" datetime="2018-04-07T22:17:15+01:00" title="2018-04-07 22:17">2018-04-07 22:17</time></a></p>
                <p class="commentline">
        
        <a href="posts/call-me-ishmael/#isso-thread">Comments</a>


        </p>
</div>
    </header><div class="e-content entry-content">
    <div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Where am I?</h2>
<div class="outline-text-2" id="text-1">
<p>
This is my <b>brand</b> new blog, problems with my past hosting service, a nauseating CMS (wordpress) and a desire to write my rants in the beautiful org-mode led me to creating this site.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">What's it for?</h2>
<div class="outline-text-2" id="text-2">
<p>
What's any blog for really?
</p>

<p>
Mostly I wanted a method of informally discussing my current projects and interests and possibly write a tutorial or two as well.
</p>
</div>
</div>
    </div>
    </article>
</div>



        
        <script src="sirsharpestjs/count.min.js" data-isso="sirsharpest"></script>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2018         <a href="mailto:nathan1hughes@gmail.com">Nathan Hughes</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="assets/js/all-nocdn.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
